定制spec kit流程：小优化
